Manipulates the vertex on the corresponding slab, roof or floor.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public void ModifySubElement(
	SlabShapeVertex vertex,
	double offset
)
  Visual Basic
Public Sub ModifySubElement ( _
	vertex As SlabShapeVertex, _
	offset As Double _
)
  Visual C++
public:
void ModifySubElement(
	SlabShapeVertex^ vertex,
	double offset
)
 Parameters
  vertex
 Type:  Autodesk.Revit.DB SlabShapeVertex
 The vertex.
  offset
 Type:  System Double
 The new value of the vertex offset.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   Thrown when the vertex is    a null reference (  Nothing  in Visual Basic)  .
   Autodesk.Revit.Exceptions ArgumentException   |   Thrown when the vertex is invalid.
 See Also
  SlabShapeEditor Class
  ModifySubElement Overload
  Autodesk.Revit.DB Namespace